/*Помогите Шерлоку Холмсу написать программу-визитку.

Программа должна выводить на экран информацию о координатах его дома на Бейкер Стрит.

S.Holmes:
51grad 31'25.48" N
0 grad  9'29.93" W
*/

#include <stdio.h>

int main() {
    printf("S.Holmes:\n51grad 31'25.48\" N\n0 grad  9'29.93\" W");
    return 0;
}
