/*Напишите программу, которая выводит на экран следующие строки:

NICKNAME: Neo
CITY: St-Petersburg
AGE: 35
HEIGHT: 180
WEIGHT: 75
 */

#include <stdio.h>

int main() {
  printf ("NICKNAME: Neo\nCITY: St-Petersburg\nAGE: 35\nHEIGHT: 180\nWEIGHT: 75");
  return 0;
}